lvx/base/InformationRegisters/бит_СоответствияАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СоответствияАналитик</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСоответствия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыСоответствийАналитик</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛеваяАналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛеваяАналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛеваяАналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваяАналитика_1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваяАналитика_2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПраваяАналитика_3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/InformationRegisters/бит_СоответствияАналитик/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция получает значение Статьи оборотов.
// 
Функция ПолучитьПравуюАналитику(ВидСоответствия, ЛеваяАналитика_1, Период) Экспорт 
    
    ПраваяАналитика_1 = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидСоответствия" , ВидСоответствия);
	Запрос.УстановитьПараметр("ЛеваяАналитика_1", ЛеваяАналитика_1);
	Запрос.УстановитьПараметр("Период",			  ?(НЕ ЗначениеЗаполнено(Период), ТекущаяДатаСеанса(), Период));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствияАналитик.ПраваяАналитика_1 КАК ПраваяАналитика_1
	|ИЗ
	|	РегистрСведений.бит_СоответствияАналитик.СрезПоследних(
	|			&Период,
	|			ВидСоответствия = &ВидСоответствия
	|				И ЛеваяАналитика_1 = &ЛеваяАналитика_1) КАК СоответствияАналитик
	|ГДЕ
	|	СоответствияАналитик.Используется";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		ПраваяАналитика_1 = Выборка.ПраваяАналитика_1;
	КонецЦикла;
	
    Возврат ПраваяАналитика_1;
	
КонецФункции // ПолучитьСтатьюОборотов()
	
// Функция получает значение Статьи ДДС по соответствию Статей оборотов.
// 
Функция ПолучитьЛевуюАналитику(ВидСоответствия, ПраваяАналитика_1, Период) Экспорт 
	
	// ++ ЕРП 
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВидСоответствия" ,  ВидСоответствия);
	Запрос.УстановитьПараметр("ПраваяАналитика_1", ПраваяАналитика_1);
	Запрос.УстановитьПараметр("Период",			  ?(НЕ ЗначениеЗаполнено(Период), ТекущаяДатаСеанса(), Период));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствияАналитик.ЛеваяАналитика_1 КАК ЛеваяАналитика_1
	|ИЗ
	|	РегистрСведений.бит_СоответствияАналитик.СрезПоследних(
	|			&Период,
	|			ВидСоответствия = &ВидСоответствия
	|				И ПраваяАналитика_1 = &ПраваяАналитика_1) КАК СоответствияАналитик
	|ГДЕ
	|	СоответствияАналитик.Используется";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивЛевыхАналитик = Новый Массив;
	Пока Выборка.Следующий() Цикл
	
		ЛеваяАналитика_1 = Выборка.ЛеваяАналитика_1;
		МассивЛевыхАналитик.Добавить(ЛеваяАналитика_1);
	
	КонецЦикла;
	
    Возврат МассивЛевыхАналитик;
	// -- ЕРП 
КонецФункции

#КонецОбласти

#КонецЕсли
